'''
변수 - 값을 담을 수 있는 메모리 저장 공간

변수명 = 값

변수타입(값 종류)
기본형
    1. 부울(bool/boolean) - True, False
        부울변수1 = True
        부울변수2 = False
    2. 정수(int) - -21억 정도 ~ 0 ~ 21억 정도(메모리 허용 음수, 0, 양수)
        num1 = 1
        num2 = 2
    3. 실수(float) - 소수점 포함 숫자
        fnum1 = 3.14
        fnum2 = 2.7
    4. 문자열(str) - 문자 저장 쌍따옴표("") 또는 홑따옴표 ('')
        str1 = "Hello Python"
        str2 = '안녕하세요!'

컬렉션(자료구조형)
    1. list - 순서가 있는 여러 데이터 집합
        list1 = ['값1', '값2', '값3']
        list2 = ['값1', 10, 3.14] # 어떤 타입이든 하나의 변수로 묶을 수 있음
    2. tuple - list와 비슷하지만 수정 불가능
        tuple1 = ('값1', '값2', '값3')
        tuple2 = ('값1', 10. 3.14) # 어떤 타입이든 하나의 변수로 묶을 수 있음
    3. set - 순서가 없고 중복 허용하지 않는 데이터 집합
        set1 = {'값1', '값2', '값3'}
        set1 = {'값1', 10. 3.14} # 어떤 타입이든 하나의 변수로 묶을 수 있음

변수명.메소드()
'''